import Footer from "../Footer";
import Header from "../Header";
import { Link } from "react-router-dom";
import "../css/Services.css";
function AssF() {
    return ( 
        <>
        <section className="assf-first-section pt-4" style={{ backgroundImage: `url(${process.env.PUBLIC_URL}/images/digital_computer_technology_kotputli_ass_mg.png)`, backgroundRepeat:"no-repeat", backgroundSize:"cover"}}>
        <Header/>
        <div class="container">
         <div class="row align-items-center mt-3">
         <iframe src="/images/RSCIT_ilearn_Digital Computer Technology.pdf" style={{width: "100%",height: "100%",border: "none"}}></iframe>
            {/* <div>
                <b>
            आपको बता दें कि ऑनलाइन टेस्ट में प्रश्नों एवं उनके विकल्प बदल सकते हैं। इसलिए प्रश्न को पूरा पढ़ें और हमारे पेज पर दिए गए सभी प्रश्नों से मिलान करके सही उत्तर भरें।
 <br/>
 <br/>

अप्रैल 2024 से पहले के बैच के Assessment-1 के प्रश्न एवं उत्तर के लिए यहाँ क्लिक करें
<br/>
 <br/>
RSCIT Assessment – 1 (कंप्यूटर का परिचय) प्रश्न उत्तर कुंजी हिंदी में 2024<br/>
<br/>
</b> 
<b className="pb-2">प्रश्न 1: दूसरी पीढ़ी के कंप्यूटर का विकास किस समय हुआ था?</b> <br/><br/>


<b>(4)</b> 1970 से 1990<br/>
<b>(1)</b> 1941 से 1955<br/>

<b>(3)</b> 1965 से 1970<br/>

<b>(2)</b> 1956 से 1965 – सही उत्तर<br/>

<br/><br/>

<b>प्रश्न 2: भारत का पहला सुपर कंप्यूटर कौन सा है?</b><br/><br/>
<b>(3)</b> परम – सही उत्तर<br/>


<b>(1)</b> अग्नि<br/>

<b>(4)</b> त्रिशूल<br/>

<b>(2)</b> फ्लो सॉल्वर<br/>
<br/><br/>

<b>प्रश्न 3: आणविक पैमाने के कंप्यूटर को क्या नाम दिया गया है?</b>
<br/>
<br/>
<b>(3)</b> नैनो कंप्यूटर – सही उत्तर<br/>

<b>(2)</b> माइक्रो कंप्यूटर<br/>
<b>(4)</b> फर्मो कंप्यूटर<br/>

<b>(1)</b> सुपर कंप्यूटर<br/>


<br/>

प्रश्न 4: पर्सनल कंप्यूटर उद्योग की शुरुआत किसके द्वारा की गई थी?
<br/>

IBM – सही उत्तर<br/>

HCL<br/>

Compaq<br/>
Apple<br/>

<br/>
प्रश्न 5: स्टोरेज से डेटा आइटम को लोकेट करना क्या कहलाता है?
<br/>
फील्ड<br/>

फीड<br/>

फेच – सही उत्तर<br/>

डेटाबेस<br/>

<br/>
प्रश्न 6: कंप्यूटर शब्द की उत्पत्ति किस भाषा से हुई है?
<br/>
जर्मन<br/>

संस्कृत<br/>

लैटिन – सही उत्तर<br/>

यूनानी<br/>
<br/>

प्रश्न 7: FLOPS का पूर्ण रूप क्या है?
<br/>
फ्लोटिंग प्रोसेसिंग ऑपरेशन्स प्रति सेकंड<br/>

फाइल लोडिंग ऑपरेशन्स प्रति सेकंड<br/>

फ्लोटिंग पॉइंट ऑपरेशन प्रति सेकंड – सही उत्तर<br/>

फाइल प्रोसेसिंग ऑपरेशन्स प्रति सेकंड<br/>
<br/>
प्रश्न 8: डेटा प्रबंधन क्षमताओं के आधार पर, इनमें से कौन से कंप्यूटर के वैध प्रकार हैं?
<br/>
उपरोक्त सभी – सही उत्तर<br/>

एनालॉग कंप्यूटर<br/>

हाइब्रिड कंप्यूटर<br/>

डिजिटल कंप्यूटर<br/>
<br/>
प्रश्न 9: दूसरी पीढ़ी के कंप्यूटरों में किस CPU घटक का उपयोग किया जाता था?
<br/>
LSI चिप्स<br/>
VLSI चिप्स<br/>

ट्रांजिस्टर – सही उत्तर<br/>

वैक्यूम ट्यूब्स<br/>


<br/>
प्रश्न 10: कौन सी पीढ़ी का कंप्यूटर इंटीग्रेटेड सर्किट (IC’s) का उपयोग करता है?

तीसरी – सही उत्तर<br/>

दूसरी<br/>

पहली<br/>

चौथी<br/>
<br/>
प्रश्न 11: एक साथ कई कार्य करने की क्षमता को _________ कहा जाता है?
<br/>
Reliability (रिलायबिलिटी)<br/>

Diligence (डिलिजेंस)<br/>

Versatility (वर्सटिलिटी) – सही उत्तर<br/>

उपरोक्त सभी<br/>
<br/>
प्रश्न 12: इनमें से कौन एक ही समय में एकाधिक उपयोगकर्ताओं का समर्थन नहीं करता है?
<br/>
मिनी कंप्यूटर<br/>

वर्कस्टेशन कंप्यूटर – सही उत्तर<br/>

मेनफ्रेम कंप्यूटर<br/>

उपरोक्त में से कोई नहीं<br/>

<br/>
प्रश्न 13: LCD का मतलब क्या है?
<br/>
लाइट कलर डिस्प्ले<br/>

लिक्विड कलर डिस्प्ले<br/>

लिक्विड क्रिस्टल डिस्प्ले – सही उत्तर<br/>

उपरोक्त में से कोई नहीं<br/>
<br/>

प्रश्न 14: निम्नलिखित में से कौन सा एप्लीकेशन के आधार पर कंप्यूटर का वर्गीकरण नहीं है?
<br/>

डिजिटल कंप्यूटर<br/>
इलेक्ट्रॉनिक कंप्यूटर<br/>

दोनों में से कोई नहीं – सही उत्तर<br/>

उपरोक्त सभी<br/>

 
<br/>
प्रश्न 15: कंप्यूटर का बुनियादी आर्किटेक्चर सबसे पहले किसके द्वारा विकसित किया गया था?<br/>

गार्डन मूर<br/>
 
चार्ल्स बैबेज<br/>

जॉन वॉन न्यूमैन – सही उत्तर<br/>

ब्लेस पास्कल<br/>
<br/>

प्रश्न 16: कंप्यूटर की कौन सी विशेषताएँ इसे इलेक्ट्रॉनिक गणना से अलग करती हैं?
<br/>
स्टोरेज<br/>
 
वर्सटिलिटी – सही उत्तर<br/>

ऑटोमेट – सही उत्तर<br/>

एक्यूरेसी<br/>
<br/>
प्रश्न 17: प्रथम पीढ़ी के कंप्यूटर सिस्टम में उपयोग किया गया?<br/>

वैक्यूम ट्यूब्स – सही उत्तर<br/>
 
मैग्नेटिक कोर<br/>

सिलिकॉन चिप्स<br/>

ट्रांजिस्टर<br/>
<br/>
प्रश्न 18: वह कंप्यूटर जो एनालॉग और डिजिटल दोनों को प्रोसेस करता हैं, कहलाता हैं?<br/>

हाइब्रिड कंप्यूटर – सही उत्तर<br/>
 
डिजिटल कंप्यूटर<br/>

मेनफ्रेम कंप्यूटर<br/>

एनालॉग कंप्यूटर<br/>
<br/>
 

प्रश्न 19: डेस्कटॉप और पर्सनल कंप्यूटर को ____________ के रूप में भी जाना जाता हैं?<br/>

मेनफ्रेम कंप्यूटर<br/>
 
क्वांटम कंप्यूटर<br/>

माइक्रो कंप्यूटर – सही उत्तर<br/>

सुपर कंप्यूटर<br/>
<br/>

प्रश्न 20: कंप्यूटर के चार प्रमुख फंक्शन का सही क्रम क्या है?<br/>

इनपुट-प्रोसेस-आउटपुट-स्टोरेज – सही उत्तर<br/>
 
इनपुट-आउटपुट-प्रोसेस-स्टोरेज<br/>

प्रोसेस-स्टोरेज-इनपुट-आउटपुट<br/>

प्रोसेस-आउटपुट-इनपुट-स्टोरेज<br/>
<br/>

प्रश्न 21: निम्नलिखित में से कौन हैंडहेल्ड सिस्टम का उपयोग करता हैं?<br/>

मेनफ्रेम कंप्यूटर<br/>
 
लैपटॉप<br/>

पीडीए – सही उत्तर<br/>

सुपर कंप्यूटर<br/>
<br/>
प्रश्न 22: ENIAC किसके द्वारा विकसित किया गया है?<br/>

वॉन न्यूमैन<br/>
 
जॉन डब्ल्यू मौचली<br/>

जॉन मौचली और जे. प्रेस्पर एकर्ट – सही उत्तर<br/>

उपरोक्त सभी<br/>
<br/>

प्रश्न 23: डेडिकेटेड कंप्यूटर से तात्पर्य है?<br/>

जो 1 तरह के सॉफ्टवेयर का उपयोग करता है<br/>
 
जिसका उपयोग केवल 1 व्यक्ति द्वारा किया जाता है<br/>

जिसे एप्लीकेशन सॉफ्टवेयर के लिए बनाया गया है<br/>

जिसे 1 और केवल 1 ही कार्य सौंपा गया है – सही उत्तर<br/>
<br/>

प्रश्न 24: निम्नलिखित में से मस्तिष्क की कार्यप्रणाली की नकल करने वाला सबसे छोटा और सबसे तेज कंप्यूटर कौन सा है?
<br/>
क्वांटम कंप्यूटर – सही उत्तर<br/>

मेनफ्रेम कंप्यूटर<br/>

सुपर कंप्यूटर<br/>

पीडीए<br/>
<br/>

प्रश्न 25: संग्रहित प्रोग्राम अवधारणा _______________ द्वारा विकसित की गई थी?<br/>

चार्ल्स बैबेज<br/>
 
वॉन न्यूमैन – सही उत्तर<br/>

मोरिस विल्केस<br/>

उपरोक्त में से कोई नहीं<br/>
<br/>

प्रश्न 26: सभी आधुनिक कंप्यूटर किस पर कार्य करते हैं?<br/>

वर्ड<br/>
 
इनफार्मेशन<br/>

डाटा – सही उत्तर<br/>

फील्ड<br/>
<br/>

प्रश्न 27: पाँचवी पीढ़ी के दौरान VLSI तकनीक को किस तकनीक में परिवर्तित किया गया था?<br/>

LSI<br/>
 
CLSI<br/>

KLSI<br/>

ULSI – सही उत्तर<br/>
<br/>

प्रश्न 28: भारत का पहला कंप्यूटर कब और कहाँ स्थापित किया गया था?<br/>

भारतीय सांख्यिकी संस्थान, कलकत्ता, 1955 – सही उत्तर<br/>
 
भारतीय प्रौद्योगिकी संस्थान, दिल्ली, 1961<br/>

भारतीय प्रौद्योगिकी संस्थान, दिल्ली, 1951<br/>

भारतीय विज्ञान संस्थान, बेंगलुरु, 1953<br/>
<br/>

प्रश्न 29: भारत का पहला सुपर कंप्यूटर PARAM 8000 किस वर्ष में लॉन्च किया गया था?<br/>

1989<br/>
 
1990<br/>

1991 – सही उत्तर<br/>

1992<br/>
<br/>

प्रश्न 30: इनमें से कौन सी माइक्रो कंप्यूटर की विशेषता है?<br/>

इसका वजन कम है<br/>
 
इसे कहीं भी ले जाया जा सकता है<br/>

उपरोक्त सभी – सही उत्तर<br/><br/>

एकाधिक उपयोगकर्ताओं का समर्थन<br/>

उम्मीद है कि आपको RSCIT Assessment 1 के सभी प्रश्नों के सही उत्तर मिल गए होंगे। अगर कोई प्रश्न इसमें नहीं है तो हमें कमेंट बॉक्स में जरूर बताएं, हम जल्द ही उस प्रश्न को इस सूची में शामिल करेंगे जिससे सभी को सही उत्तर मिल सके!
 </div> */}
        </div>
        </div>
        </section>


        <Footer/>
        </>
     );
}

export default AssF;